06-sequencing.html
<div id="outline-container-org91ac350" class="outline-2">
<h2 id="org91ac350"><code>callback</code></h2>
<div class="outline-text-2" id="text-org91ac350">
<p>
cl-collider comes with a built in method of sequencing sounds. It's fairly simple and easy to learn, as it is basically just a few functions and macros that allow sounds (or other functions) to be triggered automatically at some point in the future. Let's take a look. First, we'll define a basic synth that we can play around with:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span>defsynth<span style="color: #383539;"> </span>simple<span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span><span style="color: #FC9867;">(</span>gate<span style="color: #383539;"> </span>1<span style="color: #FC9867;">)</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>freq<span style="color: #383539;"> </span>440<span style="color: #FC9867;">)</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>pan<span style="color: #383539;"> </span>0<span style="color: #FC9867;">)</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>amp<span style="color: #383539;"> </span>0.5<span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span><span style="color: #FF6188;">let*</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span><span style="color: #A9DC76;">(</span>env<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>env-gen.kr<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>asr<span style="color: #383539;"> </span>0.01<span style="color: #383539;"> </span>1<span style="color: #383539;"> </span>0.1<span style="color: #FFD866;">)</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:gate</span><span style="color: #383539;"> </span>gate<span style="color: #383539;"> </span><span style="color: #78DCE8;">:act</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:free</span><span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span>
<span style="color: #383539;">         </span><span style="color: #A9DC76;">(</span>sig<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>sin-osc.ar<span style="color: #383539;"> </span>freq<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span>0.2<span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span>out.ar<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>pan2.ar<span style="color: #383539;"> </span>sig<span style="color: #383539;"> </span>pan<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>*<span style="color: #383539;"> </span>env<span style="color: #383539;"> </span>amp<span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span><span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
Then, we can define a function to start playing this synth:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">defun</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">testing</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">()</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span><span style="color: #FF6188;">let</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span><span style="color: #A9DC76;">(</span>syn<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>synth<span style="color: #383539;"> </span>'simple<span style="color: #383539;"> </span><span style="color: #78DCE8;">:freq</span><span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>midicps<span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>+<span style="color: #383539;"> </span>30<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>random<span style="color: #383539;"> </span>40<span style="color: #A9DC76;">)</span><span style="color: #78DCE8;">)</span><span style="color: #FFD866;">)</span><span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span>callback<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>+<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>now<span style="color: #AB9DF2;">)</span><span style="color: #383539;"> </span>0.7<span style="color: #A9DC76;">)</span><span style="color: #383539;"> </span>#'release<span style="color: #383539;"> </span>syn<span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span>callback<span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>+<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>now<span style="color: #A9DC76;">)</span><span style="color: #383539;"> </span>1<span style="color: #FC9867;">)</span><span style="color: #383539;"> </span>#'testing<span style="color: #78DCE8;">)</span><span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
The first thing the <code>testing</code> function does is start a new <code>simple</code> synth. Calling <code>(synth 'simple)</code> returns a <code>node</code> object representing the synth playing on the server. Here we provide the frequency to the synth by generating a random MIDI note number and converting it to a frequency with the <code>midicps</code> function.
</p>

<p>
Below that, we use the <code>callback</code> function to schedule the release of the synth 0.7 seconds in the future. The <code>now</code> function returns the current time, so adding 0.7 to it means "0.7 seconds from now". <code>callback</code> effectively causes a function to run at a specified time using cl-collider's scheduler. Respectively, its arguments are: when to run the function, the function to run (in this case <code>release</code>), and (optionally) the arguments to that function. Here we provide the node returned by <code>synth</code> so it will be released.
</p>

<p>
After that, we use <code>callback</code> again to re-schedule the <code>testing</code> function. That way, we continue to hear notes playing. To give some space between notes, we schedule it to trigger again after one second.
</p>

<p>
Once you define that function, you can call it using <code>(testing)</code> and you should hear random notes being played. Since this is a standard Common Lisp function, you can re-define it on the fly and the next time it's called it will automatically use the new definition. So if we wanted the function to stop playing, we could simply evaluate the following:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">defun</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">testing</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">()</span>
<span style="color: #383539;">  </span>nil<span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
Another example; if we want multiple notes simultaneously:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">defun</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">testing-2</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">()</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span><span style="color: #FF6188;">let*</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span><span style="color: #A9DC76;">(</span>note<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>+<span style="color: #383539;"> </span>30<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>random<span style="color: #383539;"> </span>40<span style="color: #FFD866;">)</span><span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span>
<span style="color: #383539;">         </span><span style="color: #A9DC76;">(</span>syns<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">loop</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:for</span><span style="color: #383539;"> </span>i<span style="color: #383539;"> </span><span style="color: #78DCE8;">:in</span><span style="color: #383539;"> </span>'<span style="color: #FFD866;">(</span>0<span style="color: #383539;"> </span>12<span style="color: #383539;"> </span>24<span style="color: #FFD866;">)</span>
<span style="color: #383539;">                  </span><span style="color: #78DCE8;">:collect</span><span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>synth<span style="color: #383539;"> </span>'simple<span style="color: #383539;"> </span><span style="color: #78DCE8;">:freq</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>midicps<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>+<span style="color: #383539;"> </span>i<span style="color: #383539;"> </span>note<span style="color: #A9DC76;">)</span><span style="color: #78DCE8;">)</span><span style="color: #FFD866;">)</span><span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span><span style="color: #FF6188;">loop</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:for</span><span style="color: #383539;"> </span>i<span style="color: #383539;"> </span><span style="color: #78DCE8;">:in</span><span style="color: #383539;"> </span>syns
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:do</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>callback<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>+<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>now<span style="color: #FFD866;">)</span><span style="color: #383539;"> </span>0.7<span style="color: #AB9DF2;">)</span><span style="color: #383539;"> </span>#'release<span style="color: #383539;"> </span>i<span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span>callback<span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>+<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>now<span style="color: #A9DC76;">)</span><span style="color: #383539;"> </span>1<span style="color: #FC9867;">)</span><span style="color: #383539;"> </span>#'testing-2<span style="color: #78DCE8;">)</span><span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
This function generates a random MIDI note, then creates two more synths that play at the same time as the first, but one and two octaves higher. This gives a chord or organ-like sound. Of course, you could just put more UGens in the synthdef itself and get the same effect if you so choose. It would certainly be easier, since you can just rely on cl-collider's multi-channel expansion in synthdefs.
</p>
</div>
</div>
