06-sequencing.org
* Closures

Using closures, we can write functions that perform different actions each time they're called:

#+BEGIN_SRC lisp
  (let ((index 0)
        (list (list 0 2 4 6)))
    (defun testing-3 ()
      (let* ((note (+ 30 (nth index list)))
             (syns (loop :for i :in '(0 12 24)
                      :collect (synth 'simple :freq (midicps (+ i note))))))
        (loop :for i :in syns
           :do (callback (+ (now) 0.7) #'release i)))
      (setf index (mod (1+ index) (length list)))
      (callback (+ (now) 1) #'testing-3)))
#+END_SRC

Since closures let us keep track of state, we can make arpeggios instead of just playing random midi notes.

