06-sequencing.html
<div id="outline-container-org362ed18" class="outline-2">
<h2 id="org362ed18">Closures</h2>
<div class="outline-text-2" id="text-org362ed18">
<p>
Using closures, we can write functions that perform different actions each time they're called:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span><span style="color: #FF6188;">let</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span><span style="color: #FC9867;">(</span>index<span style="color: #383539;"> </span>0<span style="color: #FC9867;">)</span>
<span style="color: #383539;">      </span><span style="color: #FC9867;">(</span>list<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>list<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span>2<span style="color: #383539;"> </span>4<span style="color: #383539;"> </span>6<span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">  </span><span style="color: #78DCE8;">(</span><span style="color: #FF6188;">defun</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">testing-3</span><span style="color: #383539;"> </span><span style="color: #FC9867;">()</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span><span style="color: #FF6188;">let*</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span><span style="color: #AB9DF2;">(</span>note<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>+<span style="color: #383539;"> </span>30<span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>nth<span style="color: #383539;"> </span>index<span style="color: #383539;"> </span>list<span style="color: #78DCE8;">)</span><span style="color: #FFD866;">)</span><span style="color: #AB9DF2;">)</span>
<span style="color: #383539;">           </span><span style="color: #AB9DF2;">(</span>syns<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span><span style="color: #FF6188;">loop</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:for</span><span style="color: #383539;"> </span>i<span style="color: #383539;"> </span><span style="color: #78DCE8;">:in</span><span style="color: #383539;"> </span>'<span style="color: #78DCE8;">(</span>0<span style="color: #383539;"> </span>12<span style="color: #383539;"> </span>24<span style="color: #78DCE8;">)</span>
<span style="color: #383539;">                    </span><span style="color: #78DCE8;">:collect</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>synth<span style="color: #383539;"> </span>'simple<span style="color: #383539;"> </span><span style="color: #78DCE8;">:freq</span><span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>midicps<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>+<span style="color: #383539;"> </span>i<span style="color: #383539;"> </span>note<span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #78DCE8;">)</span><span style="color: #FFD866;">)</span><span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span>
<span style="color: #383539;">      </span><span style="color: #A9DC76;">(</span><span style="color: #FF6188;">loop</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:for</span><span style="color: #383539;"> </span>i<span style="color: #383539;"> </span><span style="color: #78DCE8;">:in</span><span style="color: #383539;"> </span>syns
<span style="color: #383539;">         </span><span style="color: #78DCE8;">:do</span><span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>callback<span style="color: #383539;"> </span><span style="color: #FFD866;">(</span>+<span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>now<span style="color: #78DCE8;">)</span><span style="color: #383539;"> </span>0.7<span style="color: #FFD866;">)</span><span style="color: #383539;"> </span>#'release<span style="color: #383539;"> </span>i<span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span>setf<span style="color: #383539;"> </span>index<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>mod<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>1+<span style="color: #383539;"> </span>index<span style="color: #AB9DF2;">)</span><span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>length<span style="color: #383539;"> </span>list<span style="color: #AB9DF2;">)</span><span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span>
<span style="color: #383539;">    </span><span style="color: #FC9867;">(</span>callback<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>+<span style="color: #383539;"> </span><span style="color: #AB9DF2;">(</span>now<span style="color: #AB9DF2;">)</span><span style="color: #383539;"> </span>1<span style="color: #A9DC76;">)</span><span style="color: #383539;"> </span>#'testing-3<span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span><span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
Since closures let us keep track of state, we can make arpeggios instead of just playing random midi notes.
</p>
</div>
</div>
