06-sequencing.org
* Patterns

Though you can of course implement any behaviors you want using functions and cl-collider's scheduler as shown above, it does require a lot of bookkeeping. Calculating the frequency for each note, saving each synth in a variable, releasing it later, etcetera--and that's just for simple behavior like the above. You could, of course, define some functions and macros to make it easier, but there is another way.

If you're using SuperCollider's built-in programming language, it comes with a library of sequencing functionality called "patterns". These can be used to create musical sequences much more easily than manually writing functions like we've done above. SuperCollider's patterns language is designed to make it simple to express musical behaviors and specify synth parameters for each musical event. There are many kinds of patterns that can be used to generate everything from static sequences that sound the same every time, to totally algorithmic or random patterns that result in constantly-changing outputs. Patterns can even be combined to easily create more complex behaviors.

cl-collider doesn't have a patterns system built in, but there is a library called [[https://github.com/defaultxr/cl-patterns][cl-patterns]] which re-creates much of its functionality in Lisp. It's beyond the scope of this tutorial to describe cl-patterns in-depth, but here are a few examples to show what can be done with it:

#+BEGIN_SRC lisp
  (pbind :pdef :testing
         :instrument :simple
         :midinote (pwhite 30 70)
         :dur 1
         :legato 0.7)
#+END_SRC

This pattern produces the same output as our original ~testing~ function above. The most obvious advantage is that it's much more obvious what the code is supposed to do; each key specifies its value directly rather than being entangled in the definition of the behavior. Instead of having to write ~(+ 30 (random 40))~ to get values from ~30~ to ~70~, we can just use the ~pwhite~ pattern as ~(pwhite 30 70)~ to get values within that range.

Another advantage of using cl-patterns is that all patterns are automatically synchronized to a tempo. If the tempo is changed, all patterns will automatically use the new tempo value and will stay in sync, without us needing to update their code or remember to multiply the duration and release time by the tempo.

Here's an example of how ~testing-2~ would be rewritten as a pattern:

#+BEGIN_SRC lisp
  (pbind :pdef :testing-2
         :instrument :simple
         :midinote (pwhite 30 70)
         :midinote (p+ (pk :midinote) (list 0 12 24))
         :dur 1
         :legato 0.7)
#+END_SRC

As you can see, it's nearly the same as our first pattern; we only had to add one additional line to produce two additional notes per event. The additional notes are automatically handled and released when necessary just as expected.

And finally, here's how our last function, ~testing-3~, would look as a pattern:

#+BEGIN_SRC lisp
  (pbind :pdef :testing-3
         :instrument :simple
         :midinote (p+ 40 (pseq (list 0 2 4 6)))
         :midinote (p+ (pk :midinote) (list 0 12 24))
         :dur 1
         :legato 0.7)
#+END_SRC

(Note again that this example will not work in the current verison of cl-patterns, for the same reason as the previous.)

As you can see, we don't need to create a closure to keep track of state; the ~pseq~ pattern does that for us, allowing us to focus more on the behavior we want and less on how to implement it.

As mentioned before, a full explanation of how cl-patterns works is beyond the scope of this document, but the project's [[https://github.com/defaultxr/cl-patterns][repo]] includes plenty of documentation that should help to get you started.
