06-sequencing.html
<div id="outline-container-orgd0fe5c2" class="outline-2">
<h2 id="orgd0fe5c2">Patterns</h2>
<div class="outline-text-2" id="text-orgd0fe5c2">
<p>
Though you can of course implement any behaviors you want using functions and cl-collider's scheduler as shown above, it does require a lot of bookkeeping. Calculating the frequency for each note, saving each synth in a variable, releasing it later, etcetera&#x2013;and that's just for simple behavior like the above. You could, of course, define some functions and macros to make it easier, but there is another way.
</p>

<p>
If you're using SuperCollider's built-in programming language, it comes with a library of sequencing functionality called "patterns". These can be used to create musical sequences much more easily than manually writing functions like we've done above. SuperCollider's patterns language is designed to make it simple to express musical behaviors and specify synth parameters for each musical event. There are many kinds of patterns that can be used to generate everything from static sequences that sound the same every time, to totally algorithmic or random patterns that result in constantly-changing outputs. Patterns can even be combined to easily create more complex behaviors.
</p>

<p>
cl-collider doesn't have a patterns system built in, but there is a library called <a href="https://github.com/defaultxr/cl-patterns">cl-patterns</a> which re-creates much of its functionality in Lisp. It's beyond the scope of this tutorial to describe cl-patterns in-depth, but here are a few examples to show what can be done with it:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span>pbind<span style="color: #383539;"> </span><span style="color: #78DCE8;">:pdef</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:testing</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:instrument</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:simple</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:midinote</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>pwhite<span style="color: #383539;"> </span>30<span style="color: #383539;"> </span>70<span style="color: #78DCE8;">)</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:dur</span><span style="color: #383539;"> </span>1
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:legato</span><span style="color: #383539;"> </span>0.7<span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
This pattern produces the same output as our original <code>testing</code> function above. The most obvious advantage is that it's much more obvious what the code is supposed to do; each key specifies its value directly rather than being entangled in the definition of the behavior. Instead of having to write <code>(+ 30 (random 40))</code> to get values from <code>30</code> to <code>70</code>, we can just use the <code>pwhite</code> pattern as <code>(pwhite 30 70)</code> to get values within that range.
</p>

<p>
Another advantage of using cl-patterns is that all patterns are automatically synchronized to a tempo. If the tempo is changed, all patterns will automatically use the new tempo value and will stay in sync, without us needing to update their code or remember to multiply the duration and release time by the tempo.
</p>

<p>
Here's an example of how <code>testing-2</code> would be rewritten as a pattern:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span>pbind<span style="color: #383539;"> </span><span style="color: #78DCE8;">:pdef</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:testing-2</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:instrument</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:simple</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:midinote</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>pwhite<span style="color: #383539;"> </span>30<span style="color: #383539;"> </span>70<span style="color: #78DCE8;">)</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:midinote</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>p+<span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>pk<span style="color: #383539;"> </span><span style="color: #78DCE8;">:midinote</span><span style="color: #FC9867;">)</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>list<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span>12<span style="color: #383539;"> </span>24<span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:dur</span><span style="color: #383539;"> </span>1
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:legato</span><span style="color: #383539;"> </span>0.7<span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
As you can see, it's nearly the same as our first pattern; we only had to add one additional line to produce two additional notes per event. The additional notes are automatically handled and released when necessary just as expected.
</p>

<p>
And finally, here's how our last function, <code>testing-3</code>, would look as a pattern:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #AB9DF2;">(</span>pbind<span style="color: #383539;"> </span><span style="color: #78DCE8;">:pdef</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:testing-3</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:instrument</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">:simple</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:midinote</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>p+<span style="color: #383539;"> </span>40<span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>pseq<span style="color: #383539;"> </span><span style="color: #A9DC76;">(</span>list<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span>2<span style="color: #383539;"> </span>4<span style="color: #383539;"> </span>6<span style="color: #A9DC76;">)</span><span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:midinote</span><span style="color: #383539;"> </span><span style="color: #78DCE8;">(</span>p+<span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>pk<span style="color: #383539;"> </span><span style="color: #78DCE8;">:midinote</span><span style="color: #FC9867;">)</span><span style="color: #383539;"> </span><span style="color: #FC9867;">(</span>list<span style="color: #383539;"> </span>0<span style="color: #383539;"> </span>12<span style="color: #383539;"> </span>24<span style="color: #FC9867;">)</span><span style="color: #78DCE8;">)</span>
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:dur</span><span style="color: #383539;"> </span>1
<span style="color: #383539;">       </span><span style="color: #78DCE8;">:legato</span><span style="color: #383539;"> </span>0.7<span style="color: #000000; background-color: #d0d040;">)</span>
</pre>
</div>

<p>
(Note again that this example will not work in the current verison of cl-patterns, for the same reason as the previous.)
</p>

<p>
As you can see, we don't need to create a closure to keep track of state; the <code>pseq</code> pattern does that for us, allowing us to focus more on the behavior we want and less on how to implement it.
</p>

<p>
As mentioned before, a full explanation of how cl-patterns works is beyond the scope of this document, but the project's <a href="https://github.com/defaultxr/cl-patterns">repo</a> includes plenty of documentation that should help to get you started.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Last updated: 2023-10-04 Wed 20:58</p>
</div>
</body>
</html>